Merge pull request #14 from rojo1585/chore/add-unit-test
Chore/add unit test
